{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.18.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "4"}, {"size": "4"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_5/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/mul_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "PartitionedCall/transpose_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}]}}}}}, {"name": "PartitionedCall/mul_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "4"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_1", "op": "Transpose", "input": ["input", "PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/transpose_1", "PartitionedCall/split", "unknown_0"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "PartitionedCall/transpose_2", "op": "Transpose", "input": ["PartitionedCall/Add", "PartitionedCall/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_4", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/Relu", "PartitionedCall/transpose_4/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Add_1", "op": "_FusedConv2D", "input": ["PartitionedCall/transpose_4", "PartitionedCall/split_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "num_host_args": {"i": "0"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_5", "op": "Transpose", "input": ["PartitionedCall/Add_1", "PartitionedCall/transpose_5/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu_1", "op": "Relu", "input": ["PartitionedCall/transpose_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/onnx_tf_prefix_/Relu_1", "PartitionedCall/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Relu_2", "op": "_FusedMatMul", "input": ["PartitionedCall/flatten/Reshape", "PartitionedCall/transpose_6", "PartitionedCall/mul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "PartitionedCall/add_4", "op": "_FusedMatMul", "input": ["PartitionedCall/onnx_tf_prefix_/Relu_2", "PartitionedCall/transpose_7", "PartitionedCall/mul_3"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/transpose_1/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split", "shape": [2, 2, 1, 16], "dtype": "float32"}, {"name": "unknown_0", "shape": [16], "dtype": "float32"}, {"name": "PartitionedCall/transpose_2/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_4/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_1", "shape": [2, 2, 16, 32], "dtype": "float32"}, {"name": "unknown_2", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/transpose_5/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/transpose_6", "shape": [128, 64], "dtype": "float32"}, {"name": "PartitionedCall/mul_1", "shape": [64], "dtype": "float32"}, {"name": "PartitionedCall/transpose_7", "shape": [64, 4], "dtype": "float32"}, {"name": "PartitionedCall/mul_3", "shape": [4], "dtype": "float32"}]}]}